# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  - [-1, 1, DWSConv, [32, 3, 2]]        # 0: 32
  - [-1, 1, DWSConv, [64, 3, 2]]        # 1: 64
  - [-1, 1, DenseBlock, [64, 3, 16]]    # 2: 64
  - [-1, 1, TripletAttention, [64]]     # 3: 64 -> c2 (/4)
  - [-1, 1, DWSConv, [128, 3, 2]]       # 4: 128
  - [-1, 1, DenseBlock, [128, 3, 16]]   # 5: 128
  - [-1, 1, TripletAttention, [128]]    # 6: 128 -> c3 (/8)
  - [-1, 1, DWSConv, [256, 3, 2]]       # 7: 256
  - [-1, 1, DenseBlock, [256, 4, 24]]   # 8: 256
  - [-1, 1, TripletAttention, [256]]    # 9: 256 -> c4 (/16)
  - [-1, 1, DWSConv, [512, 3, 2]]       # 10:512
  - [-1, 1, DenseBlock, [512, 4, 24]]   # 11: 512
  - [-1, 1, ConvNeXtBlock, [512]]    # 12: 512 -> c5 (/32)

# ----------------------
# Neck + Head (Standard FPN)
# ----------------------
head :
  # ===== Left Stem =====
  - [3, 1, Conv, [128, 1, 1]]          #13: p2_left
  - [6, 1, Conv, [128, 1, 1]]          #14: p2_left
  - [9, 1, Conv, [128, 1, 1]]          #15: p2_left
  - [12, 1, Conv, [128, 1, 1]]         #16: p2_left

  - [16, 1, nn.Upsample, [None, 2, "nearest"]]     # 17: upsample P2_left
  - [[17, 15], 1,  GatedFusion, [128]]             # 18: P3_left + up_P2_left
  - [-1, 1, Conv, [128, 3, 1]]                     # 19: Fused_left_P3
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]     # 20: upsample fused left
  - [[20, 14], 1, GatedFusion, [128]]              # 21: P1_left + up_P3_left
  - [-1, 1, Conv, [128, 3, 1]]                     # 22: out_left (for head 1)
  - [22, 1, nn.Upsample, [None, 2, "nearest"]]     # 23: upsample P2_left
  - [[23, 13], 1,  GatedFusion, [128]]             # 24: P3_left + up_P2_left
  - [-1, 1, Conv, [128, 3, 1]]                     # 25: 
  # ===== Right Stem =====
  - [13, 1, SE, [128]]                # 26: attension -> P3_right
  - [14, 1, SE, [128]]                # 27: atttension -> P1_right
  - [15, 1, SE, [128]]                # 28: attension -> P2_right
  - [16, 1, SE, [128]]                # 29: attension -> P2_right

  
  - [29, 1, nn.Upsample, [None, 2, "nearest"]]     # 30: upsample P2_left
  - [[30, 28], 1,  GatedFusion, [128]]             # 31: P3_left + up_P2_left
  - [-1, 1, Conv, [128, 3, 1]]                     # 32: Fused_left_P3
  - [32, 1, nn.Upsample, [None, 2, "nearest"]]     # 33: upsample fused left
  - [[33, 27], 1, GatedFusion, [128]]              # 34: P1_left + up_P3_left
  - [-1, 1, Conv, [128, 3, 1]]                     # 35: out_left (for head 1)
  - [35, 1, nn.Upsample, [None, 2, "nearest"]]     # 36: upsample P2_left
  - [[36, 26], 1,  GatedFusion, [128]]             # 37: P3_left + up_P2_left
  - [-1, 1, Conv, [128, 3, 1]]                     # 38: 

  # ===== Fusion for other heads =====
  - [[16, 29], 1,  GatedFusion, [128]]         # 39: head_2 input (P3 fusion)
  - [-1, 1, Conv, [128, 3, 1]]                 # 40
  - [[25, 38], 1,  GatedFusion, [128]]         # 41: head_2 input (P3 fusion)
  - [-1, 1, Conv, [128, 3, 1]]                 # 42
  - [[22, 35], 1,  GatedFusion, [128]]         # 43: head_3 input (P2 fusion)
  - [-1, 1, Conv, [128, 3, 1]]                 # 44
  - [[19, 32], 1,  GatedFusion, [128]]         # 45: head_1 input (P1 fusion)
  - [-1, 1, Conv, [128, 3, 1]]                 # 46

  # ===== Detect Layer =====
  - [[40, 42, 44, 46], 1, Detect, [nc]]    # 41: Final detect
