# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  - [-1, 1, DWSConv, [32, 3, 2]]        # 0: stem (640 -> 320) , 32
  - [-1, 1, DWSConv, [64, 3, 2]]        # 1: 320 -> 160 , 64
  - [-1, 1, DenseBlock, [64, 3, 16]]    # 2: 160 -> 160 , 64
  - [-1, 1, CBAM, [64]]                 # 3: 160 -> 160, 64, C3
  - [-1, 1, DWSConv, [128, 3, 2]]       # 4: 160 -> 80, 128
  - [-1, 1, DWSConv, [256, 3, 2]]      # 5: 80 -> 40, 256
  - [-1, 1, DenseBlock, [256, 4, 24]]   # 6: 40 -> 40 , 256
  - [-1, 1, CBAM, [256]]                # 7: 40 -> 40, 256, C4
  - [-1, 1, DWSConv, [512, 3, 2]]       # 8: 40 -> 20, 512
  - [-1, 1, DWSConv, [1024, 3, 2]]       # 9: 20 -> 10, 1024
  - [-1, 1, CBAM, [1024]]               # 10: 10 -> 10, 1024, C5

# ----------------------
# Neck + Head (Standard FPN)
# ----------------------
head :
  # Neck (BiFusion)
neck:
  # Top-down Path
  - [10, 1, Conv, [256, 1, 1]]                          # 11
  - [11, 1, nn.Upsample, [None, 4, "nearest"]]          # 12
  - [[12, 7], 1, CrossAttentionFuse, [256]]             # 13
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]          # 14
  - [14, 1, Conv, [64, 1, 1]]                           # 15
  - [[15, 3], 1, CrossAttentionFuse, [64]]              # 16
  
  # Bottom-up Path
  - [16, 1, Conv, [128, 3, 2]]                          # 17
  - [17, 1, Conv, [256, 1, 1]]                          # 18
  - [[18, 13], 1, CrossAttentionFuse, [256]]            # 19
  - [19, 1, Conv, [512, 3, 2]]                          # 20
  - [[20, 11], 1, CrossAttentionFuse, [512]]            # 21
  
  # Detection heads
  - [16, 1, Conv, [128, 1, 1]]                          # 22
  - [19, 1, Conv, [256, 1, 1]]                          # 23
  - [21, 1, Conv, [512, 1, 1]]                          # 24
  - [[22, 23, 24], 1, Detect, [nc]]                     # 25
