# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  - [-1, 1, DWSConv, [32, 3, 2]]        # 0: stem (640 -> 320) , 32
  - [-1, 1, DWSConv, [64, 3, 2]]        # 1: 320 -> 160 , 64
  - [-1, 1, DenseBlock, [64, 3, 16]]    # 2: 160 -> 160 , 64
  - [-1, 1, CBAM, [64]]                 # 3: 160 -> 160, 64, C3
  - [-1, 1, DWSConv, [128, 3, 2]]       # 4: 160 -> 80, 128
  - [-1, 1, DWSConv, [256, 3, 2]]      # 5: 80 -> 40, 256
  - [-1, 1, DenseBlock, [256, 4, 24]]   # 6: 40 -> 40 , 256
  - [-1, 1, CBAM, [256]]                # 7: 40 -> 40, 256, C4
  - [-1, 1, DWSConv, [512, 3, 2]]       # 8: 40 -> 20, 512
  - [-1, 1, DWSConv, [1024, 3, 2]]       # 9: 20 -> 10, 1024
  - [-1, 1, CBAM, [1024]]               # 10: 10 -> 10, 1024, C5

# ----------------------
# Neck + Head (Standard FPN)
# ----------------------
head :
  # ===== Right Stem =====
  - [3, 1, Conv, [128, 1, 1]]         # 11: C3 -> conv, 160x160x128
  - [7, 1, Conv, [128, 1, 1]]         # 12: C4 -> conv, 40x40x128
  - [10, 1,Conv, [128, 1, 1]]         # 13: C5 -> conv, 10x10x128

  - [13, 1, nn.Upsample, [None, 4, "nearest"]]     # 14 P5: upsample C5, 40x40x128
  - [[14, 12], 1, Concat, [1]]                     # 15: concat P5,C4, 40x4x0x256
  - [-1, 1, Conv, [128, 3, 1]]                     # 16: 40x40x128
  - [-1, 1, nn.Upsample, [None, 4, "nearest"]]     # 17: upsample , 160x160x128
  - [[17, 3], 1, Concat, [1]]                     # 18: concat, 160x160x256
  - [-1, 1, Conv, [128, 3, 1]]                     # 19: 160x160x128

  # ===== Detect Layer =====
  - [[19, 16, 13], 1, Detect, [nc]]    # 41: Final detect
