# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  - [-1, 1, DWSConv, [32, 3, 2]]        # 0: stem (640 -> 320) , 32
  - [-1, 1, DWSConv, [64, 3, 2]]        # 1: 320 -> 160 , 64
  - [-1, 1, DenseBlock, [64, 3, 16]]    # 2: 160 -> 160 , 64
  - [-1, 1, CBAM, [64]]                 # 3: 160 -> 160, 64, C3
  - [-1, 1, DWSConv, [128, 3, 2]]       # 4: 160 -> 80, 128
  - [-1, 1, DWSConv, [256, 3, 2]]      # 5: 80 -> 40, 256
  - [-1, 1, DenseBlock, [256, 4, 24]]   # 6: 40 -> 40 , 256
  - [-1, 1, CBAM, [256]]                # 7: 40 -> 40, 256, C4
  - [-1, 1, DWSConv, [512, 3, 2]]       # 8: 40 -> 20, 512
  - [-1, 1, DWSConv, [1024, 3, 2]]       # 9: 20 -> 10, 1024
  - [-1, 1, CBAM, [1024]]               # 10: 10 -> 10, 1024, C5

# ----------------------
# Neck + Head (Standard FPN)
# ----------------------
head :
  # Top-down Path
  - [10, 1, Conv, [512, 1, 1]]         # 11: P2_left
  - [11, 1, Conv, [256, 1, 1]]         # 12: P2_left

  - [12, 1, nn.Upsample, [None, 4, "nearest"]]          # 13, 40x40x256
  - [[13, 7], 1, CrossAttentionFuse, [256]]             # 14, 40x40x256
  - [14, 1, nn.Upsample, [None, 4, "nearest"]]          # 15, 160x160x256
  - [15, 1, Conv, [64, 1, 1]]                           # 16, 160x160x64
  - [[16, 3], 1, CrossAttentionFuse, [64]]              # 17, 160x160x64
  
  # Bottom-up Path
  - [17, 1, DWSConv, [128, 3, 2]]                       # 18, 80x80x128
  - [18, 1, DWSConv, [256, 3, 2]]                       # 19, 40x40x256
  - [[19, 14], 1, CrossAttentionFuse, [256]]           # 20, 40x40x256
  - [20, 1, DWSConv, [512, 3, 2]]                        # 21, 20x20x512
  - [21, 1, DWSConv, [512, 3, 2]]                        # 22, 10x10x512
  - [[22, 11], 1, CrossAttentionFuse, [512]]            # 23, 10x10x512
  
  - [[23, 20, 17], 1, Detect, [nc]]                     # 25
