nc: 3
ch: [3]

backbone:
  - [-1, 1, DWSConv, [32, 3, 2]]         # 0: Stem
  - [-1, 1, DWSConv, [48, 3, 2]]         # 1: Stage 1
  - [-1, 1, DWSConv, [64, 3, 2]]         # 2: Stage 2
  - [-1, 1, SE, [64]]                    # 3
  - [-2, 1, DWSConv, [128, 3, 2]]        # 4: Stage 3
  - [-1, 1, SE, [128]]                   # 5: C3
  - [-1, 1, CondConv, [256, 3, 2]]       # 6: Stage 4
  - [-1, 1, SE, [256]]                   # 7: C4
  - [-1, 1, DeformableConv, [512, 3, 2]] # 8: Stage 5
  - [-1, 1, CBAM, [512]]                 # 9
  - [-1, 1, DeformableConv, [512, 3, 1]] # 10: Stage 6
  - [-1, 1, CBAM, [512]]                 # 11: C5

head:
  # Project C3, C4, C5 to common channels
  - [5, 1, Conv, [256, 1, 1]]        # 12: P3
  - [7, 1, Conv, [256, 1, 1]]        # 13: P4
  - [11, 1, Conv, [256, 1, 1]]       # 14: P5

  # Upsample to match P3 (1/8) and concat for small head
  - [13, 1, nn.Upsample, [None, 2, "nearest"]]    # 15: Upsample x2
  - [14, 1, nn.Upsample, [None, 4, "nearest"]]    # 16: Upsample x4
  - [[12,15,16], 1, Concat, [1]]                   # 17
  - [-1, 1, Conv, [256, 3, 1]]                      # 18

  # Mix for medium head (P4 resolution → 1/16)
  - [12, 1, Conv, [256, 3, 2]]                      # 19: Downsample x2 (stride=2 conv)
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]      # 20: Upsample x2
  - [[19,13,20], 1, Concat, [1]]                    # 21
  - [-1, 1, Conv, [256, 3, 1]]                      # 22

  # Mix for large head (P5 resolution → 1/32)
  - [12, 1, Conv, [256, 3, 4]]                      # 23: Downsample x4 (stride=4 conv)
  - [13, 1, Conv, [256, 3, 2]]                      # 24: Downsample x2 (stride=2 conv)
  - [[23,24,14], 1, Concat, [1]]                    # 25
  - [-1, 1, Conv, [256, 3, 1]]                      # 26

  # Detect heads
  - [18, 1, Detect, [nc]]                            # Detect at 1/8
  - [22, 1, Detect, [nc]]                            # Detect at 1/16
  - [26, 1, Detect, [nc]]                            # Detect at 1/32
