# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  # Stem + Stages (DWS, SE, CondConv, etc.)
  - [-1, 1, DWSConv, [32, 3, 2]]        # 0: Stem (640 → 320)
  - [-1, 1, DWSConv, [48, 3, 2]]        # 1: Stage 1 (320 → 160)
  - [-1, 1, DWSConv, [64, 3, 2]]        # 2: Stage 2 (160 → 80)
  - [-1, 1, SE, [64]]                   # 3
  - [-2, 1, DWSConv, [128, 3, 2]]       # 4: Stage 3 (80 → 40)
  - [-1, 1, SE, [128]]                  # 5 → C3
  - [-1, 1, CondConv, [256, 3, 2]]      # 6: Stage 4 (40 → 20)
  - [-1, 1, SE, [256]]                  # 7 → C4
  - [-1, 1, DeformableConv, [512, 3, 2]] # 8: Stage 5 (20 → 10)
  - [-1, 1, CBAM, [512]]                # 9
  - [-1, 1, DeformableConv, [512, 3, 1]] # 10: Stage 6 (10 → 10)
  - [-1, 1, CBAM, [512]]                # 11 → C5

# ----------------------
# Head (Direct Detection without FPN)
# ----------------------
head:
  # Reduce channels
  - [5, 1, Conv, [128, 1, 1]]           # 12: C3 reduced → p3 (40x40)
  - [7, 1, Conv, [128, 1, 1]]           # 13: C4 reduced → p4 (20x20)
  - [11, 1, Conv, [128, 1, 1]]          # 14: C5 reduced → p5 (10x10)

  # Direct detection using p3, p4, p5
  - [[12, 13, 14], 1, Detect, [nc]]     # 15: Detect heads on P3, P4, P5
