# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  # Stem + Stages (DWS, SE, CondConv, etc.)
  - [-1, 1, DWSConv, [32, 3, 2]]        # 0: Stem (640 → 320)
  - [-1, 1, DWSConv, [48, 3, 2]]        # 1: Stage 1 (320 → 160)
  - [-1, 1, DWSConv, [64, 3, 2]]        # 2: Stage 2 (160 → 80)
  - [-1, 1, SE, [64]]                   # 3
  - [-2, 1, DWSConv, [128, 3, 2]]       # 4: Stage 3 (80 → 40)
  - [-1, 1, SE, [128]]                  # 5 → C3
  - [-1, 1, CondConv, [256, 3, 2]]      # 6: Stage 4 (40 → 20)
  - [-1, 1, SE, [256]]                  # 7 → C4
  - [-1, 1, DeformableConv, [512, 3, 2]] # 8: Stage 5 (20 → 10)
  - [-1, 1, CBAM, [512]]                # 9
  - [-1, 1, DeformableConv, [512, 3, 1]] # 10: Stage 6 (10 → 10)
  - [-1, 1, CBAM, [512]]                # 11 → C5

# ----------------------
# Head (Direct Detection without FPN)
# ----------------------
head:
  # Upsample and concat features
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample from last layer by 2
  - [[-1, 6], 1, Concat, [1]]                   # Concat with backbone layer 6 (P4)
  - [-1, 3, C2f, [512]]                         # Process concat output

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # Upsample again
  - [[-1, 4], 1, Concat, [1]]                   # Concat with backbone layer 4 (P3)
  - [-1, 3, C2f, [256]]                         # Process concat output (small scale head)

  # Downsample and concat for medium scale
  - [-1, 1, Conv, [256, 3, 2]]                  # Downsample
  - [[-1, 12], 1, Concat, [1]]                  # Concat with previous layer 12
  - [-1, 3, C2f, [512]]                         # Process concat output (medium scale head)

  # Downsample and concat for large scale
  - [-1, 1, Conv, [512, 3, 2]]                  # Downsample
  - [[-1, 9], 1, Concat, [1]]                   # Concat with previous layer 9
  - [-1, 3, C2f, [1024]]                        # Process concat output (large scale head)

  # Final detection heads on P3, P4, P5
  - [[15, 18, 21], 1, Detect, [nc]]
