nc: 3
ch: [3]

backbone:
  - [-1, 1, DWSConv, [32, 3, 2]]         # 0: Stem
  - [-1, 1, DWSConv, [48, 3, 2]]         # 1: Stage 1
  - [-1, 1, DWSConv, [64, 3, 2]]         # 2: Stage 2
  - [-1, 1, SE, [64]]                    # 3
  - [-2, 1, DWSConv, [128, 3, 2]]        # 4: Stage 3
  - [-1, 1, SE, [128]]                   # 5: C3
  - [-1, 1, CondConv, [256, 3, 2]]       # 6: Stage 4
  - [-1, 1, SE, [256]]                   # 7: C4
  - [-1, 1, DeformableConv, [512, 3, 2]] # 8: Stage 5
  - [-1, 1, CBAM, [512]]                 # 9
  - [-1, 1, DeformableConv, [512, 3, 1]] # 10: Stage 6
  - [-1, 1, CBAM, [512]]                 # 11: C5

# ----------------------
# Custom Neck (Optimized for Your Backbone)
# ----------------------
head:
  # ---- Stage 1: Channel Reduction ----
  - [5, 1, DWSConv, [128, 1, 1]]       # 12: C3 → 128 ch (P3)
  - [7, 1, DWSConv, [128, 1, 1]]       # 13: C4 → 128 ch (P4)
  - [11, 1, DWSConv, [128, 1, 1]]      # 14: C5 → 128 ch (P5)

  # ---- Stage 2: Bottom-Up Mixing ----
  - [14, 1, DWSConv, [128, 3, 2]]      # 15: C5 upsampled (→ P4 scale)
  - [[13, 15], 1, Concat, [1]]         # 16: Concat C4 + P5'
  - [-1, 1, Conv, [128, 1, 1]]         # 17: Fuse → P4 fused

  - [17, 1, DWSConv, [128, 3, 2]]      # 18: P4 fused upsampled (→ P3 scale)
  - [[12, 18], 1, Concat, [1]]         # 19: Concat C3 + P4'
  - [-1, 1, Conv, [128, 1, 1]]         # 20: Fuse → Final P3

  # ---- Stage 3: Top-Down Refinement ----
  - [20, 1, DWSConv, [128, 3, 2]]      # 21: P3 downsampled (→ P4 scale)
  - [[17, 21], 1, Concat, [1]]         # 22: Concat P4 + P3↓
  - [-1, 1, Conv, [128, 1, 1]]         # 23: Final P4 refined

  # ---- Detect ----
  - [[20, 23, 14], 1, Detect, [${nc}]]    # 24: P3, P4, P5

