# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# DarkYOLOv8 - YOLOv8 with PSM blocks for low-light object detection
# Based on YOLOv8 architecture with C2f blocks replaced by PSM blocks
# PSM: Dynamic Feature Extraction Module with SimAM attention + Partial Convolution
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=darkyolov8n.yaml' will call darkyolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # DarkYOLOv8n summary: PSM-enhanced backbone
  s: [0.33, 0.50, 1024] # DarkYOLOv8s summary: PSM-enhanced backbone
  m: [0.67, 0.75, 768]  # DarkYOLOv8m summary: PSM-enhanced backbone
  l: [1.00, 1.00, 512]  # DarkYOLOv8l summary: PSM-enhanced backbone
  x: [1.00, 1.25, 512]  # DarkYOLOv8x summary: PSM-enhanced backbone

# DarkYOLOv8.0n backbone with PSM blocks
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, PSMBlock, [128]]    # 2 - PSM instead of C2f
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, PSMBlock, [256]]    # 4 - PSM instead of C2f
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, PSMBlock, [512]]    # 6 - PSM instead of C2f
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, PSMBlock, [1024]]   # 8 - PSM instead of C2f
  - [-1, 1, CSPPF, [1024, 5]]   # 9 - CSPPF instead of SPPF for low-light

# DarkYOLOv8.0n head with D-RAMiT attention in neck
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]   # cat backbone P4
  - [-1, 1, DRAMiT, [512]]      # 12 - D-RAMiT attention for global context
  - [-1, 3, C2f, [512]]         # 13 - C2f after attention

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]   # cat backbone P3
  - [-1, 1, DRAMiT, [256]]      # 16 - D-RAMiT attention for global context
  - [-1, 3, C2f, [256]]         # 17 (P3/8-small) - C2f after attention

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4 (adjusted index)
  - [-1, 1, DRAMiT, [512]]      # 20 - D-RAMiT attention for global context
  - [-1, 3, C2f, [512]]         # 21 (P4/16-medium) - C2f after attention

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]   # cat head P5
  - [-1, 1, DRAMiT, [1024]]     # 24 - D-RAMiT attention for global context
  - [-1, 3, C2f, [1024]]        # 25 (P5/32-large) - C2f after attention

  - [[17, 21, 25], 1, Detect, [nc]] # Detect(P3, P4, P5) (adjusted indices)