# efficient_skip_v2.yaml
nc: 3
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  # Stem
  - [-1, 1, DWSConv, [32, 3, 2]]                # 0

  # Stage 1
  - [-1, 1, DWSConv, [48, 3, 2]]                # 1
  - [-1, 1, SE, [48]]                           # 2 ← replaced SimpleGate

  # Stage 2 (fixed Concat with matching size)
  - [-1, 1, DWSConv, [64, 3, 2]]                 # 3
  - [-1, 1, SE, [64]]                            # 4
  - [2, 1, nn.Upsample, [None, 2, "nearest"]]    # 5 ↑ upsample Stage 1 skip to match Stage 2
  - [[5, 4], 1, Concat, [1]]                     # 6 ← now both have same size

  # Stage 3
  - [-1, 1, DWSConv, [128, 3, 2]]               # 6
  - [-1, 1, CBAM, [128]]                        # 7 → C3

  #stage 4
  - [-1, 1, DWSConv, [256, 3, 2]]               # 8
  - [-1, 1, CBAM, [256]]                        # 9
  - [7, 1, nn.Upsample, [None, 0.5, "nearest"]] # 10 ← downsample C3 to match CBAM output
  - [[10, 9], 1, Concat, [1]]                   # 11 → C4

#stage 5
- [-1, 1, DWSConv, [384, 3, 2]]               # 12
- [-1, 1, SE, [384]]                          # 13
- [9, 1, nn.Upsample, [None, 0.5, "nearest"]] # 14 ← downsample C4 to match SE output
- [[14, 13], 1, Concat, [1]]                  # 15 → C5

head:
  # Reduce to 128 dims
  - [7, 1, Conv, [128, 1, 1]]                   # 14: C3 → P3
  - [10, 1, Conv, [128, 1, 1]]                  # 15: C4 → P4
  - [13, 1, Conv, [128, 1, 1]]                  # 16: C5 → P5

  # P5 → P4 fusion
  - [16, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[15, 17], 1, Concat, [1]]                  # 18
  - [-1, 1, Conv, [128, 3, 1]]                  # 19

  # P4 → P3 fusion
  - [19, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
  - [[14, 20], 1, Concat, [1]]                  # 21
  - [-1, 1, Conv, [128, 3, 1]]                  # 22

  # Detection
  - [[22, 19, 16], 1, Detect, [nc]]             # 23
