# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  # Stem
  - [-1, 1, DWSConv, [32, 3, 2]]              # 0: Stem (640 → 320)
  
  # Stage 1
  - [-1, 1, DWSConv, [48, 3, 2]]              # 1: (320 → 160)
  - [-1, 1, ECA, [48]]                        # 2

  # Stage 2
  - [-1, 1, DWSConv, [64, 3, 2]]              # 3: (160 → 80)
  - [-1, 1, SimpleGate, [64]]                 # 4

  # Stage 3
  - [-1, 1, DWSConv, [128, 3, 2]]             # 5: (80 → 40)
  - [-1, 1, ECA, [128]]                       # 6 → C3

  # Stage 4
  - [-1, 1, GhostConv, [256, 3, 2]]           # 7: (40 → 20)
  - [-1, 1, ECA, [256]]                       # 8 → C4

  # Stage 5
  - [-1, 1, DeformableConv, [512, 3, 2]]      # 9: (20 → 10)
  - [-1, 1, CBAM, [512]]                      # 10 → C5

# ----------------------
# Neck + Head (Standard FPN)
# ----------------------
head:
  # Reduce channels to 128 for all three layers C3, C4, C5
  - [6, 1, Conv, [128, 1, 1]]                 # 11: C3 reduced → p3
  - [8, 1, Conv, [128, 1, 1]]                 # 12: C4 reduced → p4
  - [10, 1, Conv, [128, 1, 1]]                # 13: C5 reduced → p5

  # Upsample p5 and concat with p4
  - [13, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[12, 14], 1, Concat, [1]]                # 15
  - [-1, 1, Conv, [128, 3, 1]]                # 16: fused p4

  # Upsample fused p4 and concat with p3
  - [16, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[11, 17], 1, Concat, [1]]                # 18
  - [-1, 1, Conv, [128, 3, 1]]                # 19: fused p3

  # Final Detect layer using p3 (40×40), p4 (20×20), p5 (10×10)
  - [[19, 16, 13], 1, Detect, [nc]]           # 20
