# Custom Blood Cell Detection Model (fixed MiniC2f -> C2f)
nc: 3  # RBC, WBC, Platelets

backbone:
  - [-1, 1, DWSConv, [32, 3, 2]]
  - [-1, 1, DWSConv, [64, 3, 2]]
  - [-1, 2, EfficientBlock, [64]]
  - [-1, 1, DWSConv, [128, 3, 2]]
  - [-1, 1, C2f, [128, 256, 1]]      # Replaced MiniC2f
  - [-1, 1, DWSConv, [256, 3, 2]]
  - [-1, 1, C2f, [256, 512, 1]]      # Replaced MiniC2f
  - [-1, 1, CEMBlock, [512]]
  - [-1, 1, DWSConv, [1024, 3, 2]]
  - [-1, 1, C2f, [1024, 1024, 1]]    # Replaced MiniC2f

head:
  - [6, 1, Conv, [256, 1, 1]]
  - [7, 1, Conv, [256, 1, 1]]
  - [9, 1, Conv, [256, 1, 1]]

  - [12, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[13, 11], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 1]]

  - [15, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[16, 10], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 1]]

  - [18, 1, Conv, [256, 3, 2]]
  - [[19, 15], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 1]]

  - [21, 1, Conv, [256, 3, 2]]
  - [[22, 12], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 1]]

  - [[18, 21, 24], 1, Detect, [nc]]
