# ----------------------
# Custom Backbone
# ----------------------
nc: 3
backbone:
  # Stem + Stages (DWS, SE, CondConv, etc.)
  - [-1, 1, DWSConv, [32, 3, 2]]        # 0: Stem (640 → 320)
  - [-1, 1, DWSConv, [48, 3, 2]]        # 1: Stage 1 (320 → 160)
  - [-1, 1, DWSConv, [64, 3, 2]]        # 2: Stage 2 (160 → 80)
  - [-1, 1, SE, [64]]                    # 3
  - [-2, 1, DWSConv, [128, 3, 2]]       # 4: Stage 3 (80 → 40)
  - [-1, 1, SE, [128]]                   # 5 → C3
  - [-1, 1, CondConv, [256, 3, 2]]      # 6: Stage 4 (40 → 20)
  - [-1, 1, SE, [256]]                   # 7 → C4
  - [-1, 1, DeformableConv, [512, 3, 2]] # 8: Stage 5 (20 → 10)
  - [-1, 1, CBAM, [512]]                 # 9
  - [-1, 1, DeformableConv, [512, 3, 1]] # 10: Stage 6 (10 → 10)
  - [-1, 1, CBAM, [512]]                 # 11 → C5

# ----------------------
# Neck + Head (Standard FPN)
# ----------------------
head:
  # PAN-FPN (FPN2) using C2f blocks
  # C3 = 5, C4 = 7, C5 = 11
  
  # Reduce channels
  - [11, 1, Conv, [512, 1, 1]]       # 12: P5
  - [7, 1, Conv, [256, 1, 1]]        # 13: P4
  - [5, 1, Conv, [128, 1, 1]]        # 14: P3
  
  # Top-down path
  - [12, 1, nn.Upsample, [None, 2, "nearest"]]  # 15
  - [[13, 15], 1, Concat, [1]]                  # 16
  - [-1, 3, C2f, [256]]                         # 17: Fused P4
  
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[14, 18], 1, Concat, [1]]                  # 19
  - [-1, 3, C2f, [128]]                         # 20: Fused P3
  
  # Bottom-up path
  - [20, 1, Conv, [128, 3, 2]]                  # 21
  - [[21, 17], 1, Concat, [1]]                  # 22
  - [-1, 3, C2f, [256]]                         # 23: Fused P4
  
  - [23, 1, Conv, [256, 3, 2]]                  # 24
  - [[24, 12], 1, Concat, [1]]                  # 25
  - [-1, 3, C2f, [512]]                         # 26: Fused P5
  
  # Detection heads on P3, P4, P5
  - [[20, 23, 26], 1, Detect, [nc]]             # 27
