# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# LLIE-YOLO12 - YOLO12 variant with low-light improvements
# - PSM blocks in backbone
# - CSPPF replacing SPPF
# - Backbone Conv replaced with depthwise-separable conv (`DWSConv`) from `nn/modules/conv.py`
# NOTE: Only backbone Conv layers are replaced with DWSConv; neck Conv layers are left unchanged.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=llie_yolo12n.yaml' will call llie_yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# LLIE-YOLO12 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ZeroDCE, [3]]           # 0 - Zero-DCE enhancement (preprocessing). First arg must exist for parser; 3=RGB
  - [-1, 1, DWSConv, [64, 3, 2]]     # 1 - P1/2  (replaced Conv -> DWSConv)
  - [-1, 1, DWSConv, [128, 3, 2]]    # 2 - P2/4  (replaced Conv -> DWSConv)
  - [-1, 2, PSMBlock, [256]]         # 3 - PSMBlock instead of C3k2
  - [-1, 1, DWSConv, [256, 3, 2]]    # 4 - P3/8  (replaced Conv -> DWSConv)
  - [-1, 2, PSMBlock, [512]]         # 5 - PSMBlock instead of C3k2
  - [-1, 1, DWSConv, [512, 3, 2]]    # 6 - P4/16 (replaced Conv -> DWSConv)
  - [-1, 4, PSMBlock, [512]]         # 7 - PSMBlock instead of A2C2f
  - [-1, 1, DWSConv, [1024, 3, 2]]   # 8 - P5/32 (replaced Conv -> DWSConv)
  - [-1, 4, PSMBlock, [1024]]        # 9 - PSMBlock instead of A2C2f
  - [-1, 1, CSPPF, [1024, 5]]        # 10 - CSPPF in place of SPPF for low-light

# LLIE-YOLO12 head (neck kept mostly as original, Conv blocks preserved)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # 12 - cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # 15 - cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # 18 - cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # 21 - cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # 23 - Detect(P3, P4, P5)
