# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# trans_yolo12 - YOLO12 variant with a ConvNeXtBlock inserted into the backbone
# Placement: ConvNeXtBlock added at mid-level (P3/8) to enhance mid-scale features.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone with ConvNeXtBlock inserted at mid-level
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3 - P3/8
  - [-1, 1, ConvNeXtBlock, [256]]  # 4 - ConvNeXt block (mid-level feature enhancement)
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, Conv, [512, 3, 2]] # 6 - P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 7
  - [-1, 1, Conv, [1024, 3, 2]] # 8 - P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 9

# Head (unchanged from original YOLO12)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P4
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
