# YOLO12m enhanced: adds Light Enhancer, Illumination Head and Feature Fusion Attention
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
backbone:
  - [-1, 1, ConvLEM, [64, 3, 2]] # 0: Conv with integrated LightEnhancer applied to conv features
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  # Illumination head: predicts low-res 1-channel illumination map from backbone P4
  - [6, 1, IlluminationHead, [1, [20, 20]]]  # illum map available at this layer (index 12)

  # Apply feature fusion attention to the processed P4 feature using illum map
  # f = [11,12] -> A2C2f output (11) and IlluminationHead (12)
  - [[11, 12], 1, FeatureFusionAttention, []]  # fused P4 (index 13)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  # Apply feature fusion attention to the processed P3 feature using illum map
  # Apply feature fusion attention to the processed P3 feature using illum map
  # A2C2f produced P3 at index 16, IlluminationHead at 12
  - [[16, 12], 1, FeatureFusionAttention, []]  # fused P3 (index 17)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[18, 13], 1, Concat, [1]] # cat head P4: previous conv (18) and fused P4 (13)
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 20 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]] # Detect(P3 (fused 17), P4 (20), P5 (23))
